{
	"Check_Schedule": [
		"When do I need to take my next dose?",
		"What time is my next pill?",
		"When should I take my medication?",
		"What's my medication schedule for today?",
		"When is my next dose due?",
		"Can you tell me when to take my next medicine?",
		"What time is my next medication?",
		"When do I take my next pill?",
		"What’s my schedule for taking medicine today?",
		"When am I supposed to take my next dose?",
		"When do I need to take my medicine next?",
		"When should I take my pills today?",
		"What time should I take my next tablet?",
		"Tell me when my next dose is.",
		"What’s my medication timing today?"
	],
	"Log_Intake": [
		"I just took my pill.",
		"I have taken my medicine.",
		"I logged my dose.",
		"I took my medication just now.",
		"Mark my dose as taken.",
		"I already took my pill today.",
		"Log that I’ve taken my medicine.",
		"I’ve taken my dose.",
		"I just finished taking my medication.",
		"I have taken my medicine dose.",
		"Log that I took my pill.",
		"I’ve already taken my medicine today.",
		"I took my pill this morning.",
		"I have completed my medication for now.",
		"I took my meds just now."
	],
	"Set_Reminder": [
		"Remind me to take my medicine at 8 PM.",
		"Set a reminder for my pills at 7 AM.",
		"Can you remind me to take my meds at 9 PM?",
		"Set up a reminder for my medication.",
		"I need a reminder to take my pill at 10 AM.",
		"Can you remind me to take my medicine every day?",
		"Create a reminder for my morning dose.",
		"Set a reminder for my medication in the afternoon.",
		"Remind me daily to take my pills.",
		"Can you set a reminder to take my meds at noon?",
		"I need a reminder for my evening medicine.",
		"Remind me at 6 PM to take my medication.",
		"Set up a reminder for 8 AM to take my pills.",
		"Please remind me to take my medicine tonight.",
		"Create a reminder for my daily dose at 7 PM."
	],
	"Modify_Reminder": [
		"Change my morning reminder to 9 AM.",
		"Update my pill reminder to 10 AM.",
		"Move my evening reminder to 7 PM.",
		"Can you change the time for my medication reminder?",
		"Adjust my reminder to 8 PM.",
		"Please modify my pill reminder to a later time.",
		"Change the time I’m reminded to take my meds.",
		"Update my medication reminder to a new time.",
		"Can you move my medicine reminder to 11 AM?",
		"Switch my pill reminder to 6 PM.",
		"Alter the time for my daily medication reminder.",
		"Set my evening pill reminder to 9 PM.",
		"Change my medicine reminder to 8:30 AM.",
		"Please change my reminder time for my medication.",
		"Update the time for my daily reminder."
	],
	"Cancel_Reminder": [
		"Cancel my afternoon pill reminder.",
		"Turn off my medication reminder.",
		"I don’t need a reminder for my pills anymore.",
		"Stop reminding me to take my medicine.",
		"Cancel the reminder for my evening dose.",
		"Can you cancel my medication reminder?",
		"Remove the pill reminder.",
		"Turn off the daily reminder for my meds.",
		"Cancel my reminder to take the medicine.",
		"Please stop my pill reminder.",
		"Delete my medication reminder.",
		"I want to cancel my medicine reminder.",
		"Remove the reminder for my pills.",
		"Can you stop reminding me about my medication?",
		"Cancel my pill reminder at 10 AM."
	],
	"Check_History": [
		"What medications did I take yesterday?",
		"Show me my medication history.",
		"What pills did I take last week?",
		"Tell me my medication log for the past month.",
		"Can you show my pill intake history?",
		"What medicine did I take two days ago?",
		"Show me the record of my medication.",
		"What was the last dose I took?",
		"Can I see my past medication records?",
		"What medications have I taken this week?",
		"Show me the history of my pill intake.",
		"Can I view my medication log?",
		"What did I take yesterday?",
		"Tell me the meds I took last month.",
		"Can you pull up my medication history?"
	],
	"Request_Refill": [
		"I need to refill my prescription.",
		"Can you request a refill for my medicine?",
		"I’m running low on my pills, please refill.",
		"Request a new supply of my medication.",
		"Can you order more of my medicine?",
		"Refill my prescription.",
		"I need a new prescription refill.",
		"Please order a refill for my medication.",
		"Get my prescription refilled.",
		"Can you help me with a refill?",
		"I need to request a medication refill.",
		"Request more of my medicine.",
		"Can I get a refill for my prescription?",
		"I need more of my meds, please refill.",
		"Order a refill for my pills."
	],
	"Add_Medication": [
		"I'm starting a new medication.",
		"Add a new pill to my schedule.",
		"I need to start taking a new medicine.",
		"Can you add a new medication for me?",
		"Add this medicine to my list.",
		"I have a new prescription, add it.",
		"Please add a new drug to my regimen.",
		"I’m on a new medication, add it.",
		"Add another medication to my reminders.",
		"Include a new pill in my schedule.",
		"Start tracking my new medication.",
		"I need to add a new medicine to my list.",
		"Can you include this new medication?",
		"Add this to my daily meds.",
		"I want to start a new medication, please add it."
	],
	"Remove_Medication": [
		"Stop reminding me about the painkillers.",
		"Remove this medicine from my schedule.",
		"Can you delete this medication?",
		"Take this pill off my list.",
		"I’m no longer taking this medication, remove it.",
		"Please stop tracking this medication.",
		"Remove this drug from my daily routine.",
		"Can you take this medicine off my reminders?",
		"I don’t need this pill anymore, remove it.",
		"Delete this medication from my list.",
		"Take this medicine out of my schedule.",
		"Remove this from my medication list.",
		"Can you remove this pill from my regimen?",
		"Stop tracking this medicine for me.",
		"Remove this drug from my daily intake."
	],
	"Get_Medication_Info": [
		"What is this pill for?",
		"Tell me more about this medication.",
		"What does this medicine do?",
		"Can you give me information on this drug?",
		"What is this medication used for?",
		"Why am I taking this pill?",
		"What’s the purpose of this medicine?",
		"What does this pill treat?",
		"Can you tell me about this medication?",
		"What’s the function of this drug?",
		"What is this medicine supposed to do?",
		"Give me details about this medication.",
		"What is this drug for?",
		"Why do I need this pill?",
		"What does this medication help with?"
	],
	"Update_Dosage": [
		"Change my dosage to 2 pills a day.",
		"Update my medicine dosage.",
		"Can you adjust my dosage?",
		"I need to change the amount of medication I take.",
		"Update my dosage to a higher amount.",
		"Change the dosage for my medication.",
		"Adjust my medicine to 3 pills a day.",
		"Can you modify my dosage?",
		"I need to increase my medication dosage.",
		"Update my dose to a lower amount.",
		"Change the number of pills I take.",
		"Please adjust the dosage for my meds.",
		"Modify my medication dosage.",
		"Can you change my dosage to 1 pill a day?",
		"Update my prescription to a new dosage."
	],
	"Skip_Dose": [
		"I missed my dose today.",
		"Skip my dose for now.",
		"I didn’t take my medication this morning.",
		"Log that I skipped my pill.",
		"I forgot to take my medicine today.",
		"Can you skip my dose for today?",
		"I need to skip my medication.",
		"I didn’t take my meds, skip it.",
		"Skip today’s dose for me.",
		"Mark my dose as skipped.",
		"I won’t take my medicine today, skip it.",
		"I missed my pills, can you log it?",
		"Can you skip my dose for this evening?",
		"I didn’t take my dose, skip it.",
		"I forgot my pill, please skip the dose."
	],
	"Emergency_Assistance": [
		"What should I do if I took too much?",
		"Help, I overdosed on my medication.",
		"I think I took too many pills, what now?",
		"What do I do if I overdose?",
		"I took more medicine than I should have.",
		"Help me, I took too much of my meds.",
		"What to do if I accidentally take too many pills?",
		"I think I overdosed, what should I do?",
		"I took an extra dose by mistake.",
		"Can you help? I took too much medication.",
		"What happens if I overdose on my medicine?",
		"I need help, I took too many pills.",
		"What do I do after taking too many meds?",
		"I took an overdose of my medication, what now?",
		"Help, I took more pills than prescribed."
	],
	"Provide_Feedback": [
		"The reminders are too frequent.",
		"I don’t like the app notifications.",
		"Can I give feedback on the app?",
		"I have a suggestion for improvement.",
		"The reminders aren’t working well.",
		"Can you take my feedback?",
		"I want to provide feedback about the app.",
		"The notifications are too annoying.",
		"I have some feedback on the reminders.",
		"Can I suggest some changes?",
		"Here’s what I think about the app.",
		"I’d like to share my opinion on the app.",
		"Can I submit feedback?",
		"The app could be better with some changes.",
		"I have issues with the app I’d like to report."
	],
	"Ask_Side_Effects": [
		"Are there any side effects for this medication?",
		"What are the potential side effects?",
		"Can you tell me the side effects of this drug?",
		"What should I expect in terms of side effects?",
		"Are there any risks with this medicine?",
		"Tell me about the side effects.",
		"Can this medication cause side effects?",
		"What are the possible side effects?",
		"Does this drug have any side effects?",
		"What should I watch out for with this medication?",
		"Can you list the side effects?",
		"What side effects might I experience?",
		"Are there any side effects I should know about?",
		"What are the risks of taking this medication?",
		"Tell me if there are any side effects."
	],
	"First_Aid_Info": [
		"What should I do if someone is choking?",
		"How do I treat a burn?",
		"Give me first aid instructions for a cut.",
		"How do I perform CPR?",
		"What’s the first aid for a sprained ankle?",
		"How do I handle a nosebleed?",
		"What should I do for a seizure?",
		"How do I treat a bee sting?",
		"What are the steps for dealing with a broken bone?",
		"How do I treat someone who’s fainted?",
		"What should I do if someone has heat exhaustion?",
		"How do I handle a diabetic emergency?",
		"What’s the first aid for poisoning?",
		"How do I treat an eye injury?",
		"What should I do if someone is in shock?"
	],
	"General_Small_Talk": [
		"How are you today?",
		"Tell me a health tip.",
		"What’s the weather like?",
		"Do you have any health advice?",
		"How can I improve my health?",
		"Any tips for staying positive?",
		"What’s a good way to relax?",
		"What’s your favorite health tip?",
		"How can I stay motivated to exercise?",
		"What’s the best way to start my day?",
		"Tell me something interesting about health.",
		"How can I make healthy eating easier?",
		"What’s a quick stress reliever?",
		"Any advice on better sleep?",
		"What’s a fun fact about health?"
	],
	"Symptoms_Check": [
		"I have a headache, what could it be?",
		"What should I do if I feel dizzy?",
		"I have a fever, what might it be?",
		"Why do I feel nauseous?",
		"What could cause shortness of breath?",
		"My stomach hurts, what could it be?",
		"I have a sore throat, what should I do?",
		"Why am I coughing so much?",
		"What should I do if I have chest pain?",
		"Why do I feel so tired all the time?",
		"What could cause my joints to ache?",
		"Why am I experiencing blurred vision?",
		"What might cause a sudden rash?",
		"What could be causing my back pain?",
		"Why do I feel lightheaded?"
	],
	"Healthy_Lifestyle_Tips": [
		"Give me a healthy eating tip.",
		"How can I reduce stress?",
		"What’s a good exercise for staying fit?",
		"How can I improve my sleep quality?",
		"What’s a healthy habit to start?",
		"How can I stay hydrated?",
		"What’s a tip for better mental health?",
		"How can I eat more vegetables?",
		"What’s a good way to increase my physical activity?",
		"How can I avoid getting sick?",
		"What’s a tip for maintaining a healthy weight?",
		"How can I improve my posture?",
		"What’s a way to boost my energy levels?",
		"How can I keep my heart healthy?",
		"What’s a quick healthy snack idea?"
	],
	"Medication_Interactions": [
		"Can I take ibuprofen with my other medication?",
		"Is it safe to mix these pills?",
		"Do these medicines interact with each other?",
		"Can I take this medication with alcohol?",
		"What happens if I take these drugs together?",
		"Will these medications interfere with each other?",
		"Is it okay to take my vitamin with my prescription?",
		"Can I take over-the-counter medicine with my prescription?",
		"What’s the risk of combining these two medications?",
		"Are there any side effects of taking these together?",
		"Do I need to avoid anything while on this medication?",
		"Is it safe to take these medications at the same time?",
		"Can these pills be taken together?",
		"Should I be concerned about drug interactions with my medications?",
		"What are the possible interactions between these medicines?"
	],
	"Locate_Nearest_Pharmacy": [
		"Where is the closest pharmacy?",
		"Find a pharmacy near me.",
		"Locate the nearest drugstore.",
		"Is there a pharmacy nearby?",
		"Where can I get my prescription filled?",
		"Where is the nearest place to buy medicine?",
		"Find the closest pharmacy to me.",
		"Locate a drugstore in my area.",
		"Where can I pick up my medication?",
		"What’s the nearest pharmacy?",
		"Can you find a pharmacy close to me?",
		"Where can I get my medicine?",
		"Show me the nearest drugstore.",
		"Where’s the closest place to get my prescription?",
		"Help me find a nearby pharmacy."
	],
	"Emergency_Contact": [
		"Call an emergency contact.",
		"Set my emergency contact.",
		"Who should I contact in an emergency?",
		"Update my emergency contact information.",
		"Who is my emergency contact?",
		"What’s the number for my emergency contact?",
		"Add a new emergency contact.",
		"Who do I call in an emergency?",
		"Set up an emergency contact.",
		"Who is listed as my emergency contact?",
		"Give me the contact info for my emergency contact.",
		"Change my emergency contact.",
		"Who should be called if there’s an emergency?",
		"Provide the details for my emergency contact.",
		"How do I update my emergency contact?"
	],
	"Daily_Health_Check": [
		"Log my blood pressure today.",
		"Track my weight.",
		"Record my mood for today.",
		"Log my daily exercise.",
		"What’s my blood sugar level today?",
		"Track my daily steps.",
		"Record my hydration for the day.",
		"Log my sleep hours for today.",
		"How’s my blood pressure today?",
		"Track my daily calories.",
		"Log my heart rate for today.",
		"What’s my weight today?",
		"Record my daily activity.",
		"Track my water intake today.",
		"Log my stress level for today."
	],
	"Add_Medical_Appointment": [
		"Schedule a doctor's appointment for me.",
		"I need to book a medical appointment.",
		"Add a new doctor's visit to my calendar.",
		"Can you schedule a check-up with my doctor?",
		"Set up an appointment with my physician.",
		"I want to book a doctor's appointment.",
		"Schedule a medical consultation for me.",
		"Can you add a doctor's visit to my schedule?",
		"Book a health check-up for me.",
		"I need to see the doctor, please schedule it.",
		"Add a new appointment with my doctor.",
		"Can you set up a medical appointment?",
		"I need to schedule a doctor’s visit.",
		"Book a medical appointment for next week.",
		"Schedule a check-up appointment for me."
	],
	"Remove_Medical_Appointment": [
		"Cancel my doctor's appointment.",
		"Remove the upcoming medical visit from my calendar.",
		"Can you delete my doctor's appointment?",
		"Take my doctor’s appointment off the schedule.",
		"Cancel the medical appointment I have.",
		"Please remove the doctor’s visit from my appointments.",
		"I want to cancel my medical appointment.",
		"Can you remove my health check-up from the calendar?",
		"Delete the scheduled appointment with my doctor.",
		"Cancel the doctor's visit I have planned.",
		"Remove my upcoming medical appointment.",
		"Can you cancel the health appointment?",
		"I need to cancel my doctor’s visit.",
		"Please remove the doctor's appointment from my schedule.",
		"Delete my upcoming medical visit."
	],
	"Get_Medical_Appointment_Info": [
		"When is my next doctor's appointment?",
		"Tell me about my upcoming medical visit.",
		"What time is my next health check-up?",
		"Can you give me details on my next doctor's visit?",
		"When do I have a doctor’s appointment scheduled?",
		"What’s the date of my next medical appointment?",
		"When is my appointment with Dr. {doctor_name}?",
		"Give me the details of my next doctor’s visit.",
		"When is my next scheduled medical check-up?",
		"What time is my next doctor’s appointment?",
		"When do I see the doctor next?",
		"Can you remind me of my next medical visit?",
		"What is the date of my next doctor's appointment?",
		"When is my upcoming medical appointment?",
		"Give me the time and date of my next doctor's visit."
	],
	"Update_Medical_Appointment": [
		"Reschedule my doctor's appointment.",
		"Change the time of my medical visit.",
		"Can you update my doctor's appointment to a new time?",
		"I need to reschedule my check-up.",
		"Update my doctor’s visit to a different day.",
		"Change the date of my medical appointment.",
		"Please reschedule my health check-up.",
		"Move my doctor's appointment to another time.",
		"Can you update the time for my doctor’s visit?",
		"I need to change the time of my doctor's appointment.",
		"Reschedule my doctor’s visit for a different date.",
		"Update my upcoming medical appointment.",
		"Can you move my doctor’s appointment?",
		"Change the schedule for my medical visit.",
		"Reschedule my check-up to a new date."
	],
	"Get_Next_Appointment_Reminder": [
		"Remind me about my next doctor’s appointment.",
		"When is my next medical visit?",
		"Give me a reminder for my upcoming doctor’s visit.",
		"Can you remind me when I need to see the doctor?",
		"When do I have a doctor’s appointment?",
		"What’s the reminder for my next medical check-up?",
		"Tell me when my next doctor’s appointment is.",
		"Remind me about my next health appointment.",
		"When am I scheduled to see the doctor next?",
		"Can you give me a reminder for my doctor’s visit?",
		"What’s the reminder for my next medical appointment?",
		"When is my next appointment with the doctor?",
		"Please remind me about my upcoming doctor’s visit.",
		"When is my next health check-up?",
		"Remind me when I have to visit the doctor."
	],
	"General_Wellbeing_Check": [
		"How am I doing today?",
		"Check my overall health.",
		"How’s my wellbeing?",
		"Review my health stats.",
		"How am I feeling today?",
		"What’s my health status today?",
		"How’s my general health?",
		"Check my daily health report.",
		"How healthy am I today?",
		"What’s my wellness status?",
		"How am I doing with my health goals?",
		"Evaluate my health for today.",
		"Check my daily wellness.",
		"How’s my physical health today?",
		"Give me a health check for today."
	],
	"Get_Adherence_Summary": [
		"Give me a summary of my medication adherence.",
		"How am I doing with my medication schedule?",
		"What’s my adherence rate for this week?",
		"Can you provide an overview of my medication adherence?",
		"How many doses have I missed this month?",
		"Tell me about my adherence statistics.",
		"What’s my adherence report for this period?",
		"Provide a summary of my medication compliance.",
		"How well am I following my medication plan?",
		"Show me my adherence history.",
		"What’s my medication adherence like this week?",
		"Give me a summary of missed and taken doses.",
		"Can you summarize my medication adherence data?",
		"How often have I missed my doses?",
		"Tell me about my adherence over the past month."
	]
}
