{
	"Check_Schedule": [
		"When do I need to take my next dose?",
		"What time is my next pill?",
		"When should I take my medication?",
		"What's my medication schedule for today?",
		"When is my next dose due?",
		"Can you tell me when to take my next medicine?",
		"What time is my next medication?",
		"When do I take my next pill?",
		"What’s my schedule for taking medicine today?",
		"When am I supposed to take my next dose?",
		"When do I need to take my medicine next?",
		"When should I take my pills today?",
		"What time should I take my next tablet?",
		"Tell me when my next dose is.",
		"What’s my medication timing today?"
	],
	"Log_Intake": [
		"I just took my pill.",
		"I have taken my medicine.",
		"I logged my dose.",
		"I took my medication just now.",
		"Mark my dose as taken.",
		"I already took my pill today.",
		"Log that I’ve taken my medicine.",
		"I’ve taken my dose.",
		"I just finished taking my medication.",
		"I have taken my medicine dose.",
		"Log that I took my pill.",
		"I’ve already taken my medicine today.",
		"I took my pill this morning.",
		"I have completed my medication for now.",
		"I took my meds just now."
	],
	"Set_Reminder": [
		"Remind me to take my medicine at 8 PM.",
		"Set a reminder for my pills at 7 AM.",
		"Can you remind me to take my meds at 9 PM?",
		"Set up a reminder for my medication.",
		"I need a reminder to take my pill at 10 AM.",
		"Can you remind me to take my medicine every day?",
		"Create a reminder for my morning dose.",
		"Set a reminder for my medication in the afternoon.",
		"Remind me daily to take my pills.",
		"Can you set a reminder to take my meds at noon?",
		"I need a reminder for my evening medicine.",
		"Remind me at 6 PM to take my medication.",
		"Set up a reminder for 8 AM to take my pills.",
		"Please remind me to take my medicine tonight.",
		"Create a reminder for my daily dose at 7 PM."
	],
	"Modify_Reminder": [
		"Change my morning reminder to 9 AM.",
		"Update my pill reminder to 10 AM.",
		"Move my evening reminder to 7 PM.",
		"Can you change the time for my medication reminder?",
		"Adjust my reminder to 8 PM.",
		"Please modify my pill reminder to a later time.",
		"Change the time I’m reminded to take my meds.",
		"Update my medication reminder to a new time.",
		"Can you move my medicine reminder to 11 AM?",
		"Switch my pill reminder to 6 PM.",
		"Alter the time for my daily medication reminder.",
		"Set my evening pill reminder to 9 PM.",
		"Change my medicine reminder to 8:30 AM.",
		"Please change my reminder time for my medication.",
		"Update the time for my daily reminder."
	],
	"Cancel_Reminder": [
		"Cancel my afternoon pill reminder.",
		"Turn off my medication reminder.",
		"I don’t need a reminder for my pills anymore.",
		"Stop reminding me to take my medicine.",
		"Cancel the reminder for my evening dose.",
		"Can you cancel my medication reminder?",
		"Remove the pill reminder.",
		"Turn off the daily reminder for my meds.",
		"Cancel my reminder to take the medicine.",
		"Please stop my pill reminder.",
		"Delete my medication reminder.",
		"I want to cancel my medicine reminder.",
		"Remove the reminder for my pills.",
		"Can you stop reminding me about my medication?",
		"Cancel my pill reminder at 10 AM."
	],
	"Check_History": [
		"What medications did I take yesterday?",
		"Show me my medication history.",
		"What pills did I take last week?",
		"Tell me my medication log for the past month.",
		"Can you show my pill intake history?",
		"What medicine did I take two days ago?",
		"Show me the record of my medication.",
		"What was the last dose I took?",
		"Can I see my past medication records?",
		"What medications have I taken this week?",
		"Show me the history of my pill intake.",
		"Can I view my medication log?",
		"What did I take yesterday?",
		"Tell me the meds I took last month.",
		"Can you pull up my medication history?"
	],
	"Request_Refill": [
		"I need to refill my prescription.",
		"Can you request a refill for my medicine?",
		"I’m running low on my pills, please refill.",
		"Request a new supply of my medication.",
		"Can you order more of my medicine?",
		"Refill my prescription.",
		"I need a new prescription refill.",
		"Please order a refill for my medication.",
		"Get my prescription refilled.",
		"Can you help me with a refill?",
		"I need to request a medication refill.",
		"Request more of my medicine.",
		"Can I get a refill for my prescription?",
		"I need more of my meds, please refill.",
		"Order a refill for my pills."
	],
	"Add_Medication": [
		"I'm starting a new medication.",
		"Add a new pill to my schedule.",
		"I need to start taking a new medicine.",
		"Can you add a new medication for me?",
		"Add this medicine to my list.",
		"I have a new prescription, add it.",
		"Please add a new drug to my regimen.",
		"I’m on a new medication, add it.",
		"Add another medication to my reminders.",
		"Include a new pill in my schedule.",
		"Start tracking my new medication.",
		"I need to add a new medicine to my list.",
		"Can you include this new medication?",
		"Add this to my daily meds.",
		"I want to start a new medication, please add it."
	],
	"Remove_Medication": [
		"Stop reminding me about the painkillers.",
		"Remove this medicine from my schedule.",
		"Can you delete this medication?",
		"Take this pill off my list.",
		"I’m no longer taking this medication, remove it.",
		"Please stop tracking this medication.",
		"Remove this drug from my daily routine.",
		"Can you take this medicine off my reminders?",
		"I don’t need this pill anymore, remove it.",
		"Delete this medication from my list.",
		"Take this medicine out of my schedule.",
		"Remove this from my medication list.",
		"Can you remove this pill from my regimen?",
		"Stop tracking this medicine for me.",
		"Remove this drug from my daily intake."
	],
	"Get_Medication_Info": [
		"What is this pill for?",
		"Tell me more about this medication.",
		"What does this medicine do?",
		"Can you give me information on this drug?",
		"What is this medication used for?",
		"Why am I taking this pill?",
		"What’s the purpose of this medicine?",
		"What does this pill treat?",
		"Can you tell me about this medication?",
		"What’s the function of this drug?",
		"What is this medicine supposed to do?",
		"Give me details about this medication.",
		"What is this drug for?",
		"Why do I need this pill?",
		"What does this medication help with?"
	],
	"Update_Dosage": [
		"Change my dosage to 2 pills a day.",
		"Update my medicine dosage.",
		"Can you adjust my dosage?",
		"I need to change the amount of medication I take.",
		"Update my dosage to a higher amount.",
		"Change the dosage for my medication.",
		"Adjust my medicine to 3 pills a day.",
		"Can you modify my dosage?",
		"I need to increase my medication dosage.",
		"Update my dose to a lower amount.",
		"Change the number of pills I take.",
		"Please adjust the dosage for my meds.",
		"Modify my medication dosage.",
		"Can you change my dosage to 1 pill a day?",
		"Update my prescription to a new dosage."
	],
	"Skip_Dose": [
		"I missed my dose today.",
		"Skip my dose for now.",
		"I didn’t take my medication this morning.",
		"Log that I skipped my pill.",
		"I forgot to take my medicine today.",
		"Can you skip my dose for today?",
		"I need to skip my medication.",
		"I didn’t take my meds, skip it.",
		"Skip today’s dose for me.",
		"Mark my dose as skipped.",
		"I won’t take my medicine today, skip it.",
		"I missed my pills, can you log it?",
		"Can you skip my dose for this evening?",
		"I didn’t take my dose, skip it.",
		"I forgot my pill, please skip the dose."
	],
	"Emergency_Assistance": [
		"What should I do if I took too much?",
		"Help, I overdosed on my medication.",
		"I think I took too many pills, what now?",
		"What do I do if I overdose?",
		"I took more medicine than I should have.",
		"Help me, I took too much of my meds.",
		"What to do if I accidentally take too many pills?",
		"I think I overdosed, what should I do?",
		"I took an extra dose by mistake.",
		"Can you help? I took too much medication.",
		"What happens if I overdose on my medicine?",
		"I need help, I took too many pills.",
		"What do I do after taking too many meds?",
		"I took an overdose of my medication, what now?",
		"Help, I took more pills than prescribed."
	],
	"Provide_Feedback": [
		"The reminders are too frequent.",
		"I don’t like the app notifications.",
		"Can I give feedback on the app?",
		"I have a suggestion for improvement.",
		"The reminders aren’t working well.",
		"Can you take my feedback?",
		"I want to provide feedback about the app.",
		"The notifications are too annoying.",
		"I have some feedback on the reminders.",
		"Can I suggest some changes?",
		"Here’s what I think about the app.",
		"I’d like to share my opinion on the app.",
		"Can I submit feedback?",
		"The app could be better with some changes.",
		"I have issues with the app I’d like to report."
	],
	"Ask_Side_Effects": [
		"Are there any side effects for this medication?",
		"What are the potential side effects?",
		"Can you tell me the side effects of this drug?",
		"What should I expect in terms of side effects?",
		"Are there any risks with this medicine?",
		"Tell me about the side effects.",
		"Can this medication cause side effects?",
		"What are the possible side effects?",
		"Does this drug have any side effects?",
		"What should I watch out for with this medication?",
		"Can you list the side effects?",
		"What side effects might I experience?",
		"Are there any side effects I should know about?",
		"What are the risks of taking this medication?",
		"Tell me if there are any side effects."
	]
}
